//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// File:            config.js
// Defines:
// Dependencies:
// Description:     this is the Javascript configration file for Zhuomi
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/* +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
/* Config - Begin */

ZM.Config = {

    Msg: {

        Format: {
            mail: "邮箱输入错误，请重试",
            username: "昵称须小于{0}个字符",
            password: "密码必须在6-16个字符之间"
        },

        Valid: {
            mail: "请输入邮箱",
            username: "请输入用户名，以便于日后交流",
            password: "密码不能为空",
            numeric: "请输入数字"
        }

    },

    Value: {
        maxUsername: 12
    }


};

/* Config - End */